app/controllers/api/v1/categories_controller.rb

    	def index
    		@categories = Category.all
---
SELECT  "categories".* FROM "categories"  ORDER BY "categories"."id" ASC LIMIT 1

      def destroy
        if @category.destroy
---
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 165]]

      def update
        if @category.update_attributes(category_params)
---
UPDATE "categories" SET "name" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["name", "new name"], ["updated_at", "2015-08-07 09:57:47.292305"], ["id", 122]]

      def categories_with_pics
        @categories = Category.all
---
SELECT  "categories".* FROM "categories"  ORDER BY "categories"."id" ASC LIMIT 1

    	def set_category
    		@category = Category.find_by_id(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1  ORDER BY "categories"."id" ASC LIMIT 1  [["id", 612]]