app/controllers/api/v1/comments_controller.rb

    	def create
    		@comment = Comment.new(comment_params.merge(:user_id => current_user.id))
        if @comment.save
---
INSERT INTO "comments" ("text", "picture_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "TestCom"], ["picture_id", 373], ["user_id", 223], ["created_at", "2015-08-12 08:35:48.184496"], ["updated_at", "2015-08-12 08:35:48.184496"]]

    	def destroy
      	if @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 61]]

      def update
        if @comment.update_attributes(comment_params)
---
UPDATE "comments" SET "text" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["text", "update"], ["updated_at", "2015-08-12 09:10:25.746227"], ["id", 47]]