app/controllers/api/v1/pictures_controller.rb

    	def index
    		@pictures = Picture.order_desc
---
SELECT  "pictures".* FROM "pictures"  ORDER BY "pictures"."id" ASC LIMIT 1

    	def create
    		@pic = Picture.new(picture_params)
        if @pic.save
---
INSERT INTO "pictures" ("title", "description", "photo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "TestPic"], ["description", "DescriereDinFactory"], ["photo", "file.jpeg"], ["created_at", "2015-08-08 08:40:49.140631"], ["updated_at", "2015-08-08 08:40:49.140631"]]

      def update
        if @pic.update_attributes(picture_params)
---
UPDATE "pictures" SET "title" = $1, "updated_at" = $2 WHERE "pictures"."id" = $3  [["title", "new title"], ["updated_at", "2015-08-08 08:57:01.738918"], ["id", 139]]

    	def set_pic
    		@pic = Picture.find_by_id(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1  ORDER BY "pictures"."id" ASC LIMIT 1  [["id", 333]]