app/controllers/api/v1/users_controller.rb

      def create
        @user = User.create(user_params)
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

      def update
        respond_with :api, User.update(current_user.id, user_params)
---
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "new_email@yahoo.com"], ["updated_at", "2015-08-12 08:22:14.457569"], ["id", 194]]